In [1]:
import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)
import datetime as dt
import time
import math
# Input data files are available in the "../input/" directory.
# For example, running this (by clicking run or pressing Shift+Enter) will list all files under the input directory
import matplotlib.pyplot as plt
import os
from pathlib import Path
import time
import cartopy.crs as ccrs
import sqlite3
from IPython.utils import io

df= pd.read_csv('orchid_observation.csv', index_col='id', parse_dates=['date_observed_on'])
df.dtypes

common_name                   object
scientific_name               object
latitude                     float64
longitude                    float64
date_observed_on      datetime64[ns]
place_guess                   object
place_state_name              object
place_country_name            object
dtype: object

# Working with line/cell magic

Simply loading SQL databae will not work, we first need to load external script sql

In [2]:
#loading external SQL magic
%load_ext sql
#If database is not available, it will create a database
%sql sqlite:///orchid.db
#print out tabels in the database
%sql SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:///orchid.db
Done.

[('orchid_all',)]

## Create table
Now we create a table with few columns, IF NOT EXISTS statement makes sure there isn't a table already present

In [27]:
%%sql
CREATE TABLE IF NOT EXISTS orchid ('common name' char, 
                     'scientific_name' char, 
                     'latitude' float, 
                     'longitutde' float );

SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:///orchid.db
Done.
Done.

[('orchid',)]

In [28]:
%sql SELECT * FROM orchid LIMIT 5

 * sqlite:///orchid.db
Done.

[]

### Adding values
Now we add a row from *df* using <b>INSERT</b>

In [29]:
%%sql
INSERT INTO orchid VALUES
('spotted coralroot', 'Corallorhiza maculata',
 39.968807, -105.54962);
SELECT * FROM orchid LIMIT 5

 * sqlite:///orchid.db
1 rows affected.
Done.

[('spotted coralroot', 'Corallorhiza maculata', 39.968807, -105.54962)]

We can also use python variables to insert values into a SQL table using a ':'

In [30]:
common_name = df.iloc[1].common_name
scientific_name = df.iloc[1].scientific_name
latitude = df.iloc[1].latitude
longitude = df.iloc[1].longitude
%sql INSERT INTO orchid VALUES (:common_name, :scientific_name, :latitude, :longitude);
%sql SELECT * FROM orchid LIMIT 5

 * sqlite:///orchid.db
1 rows affected.
 * sqlite:///orchid.db
Done.

[('spotted coralroot', 'Corallorhiza maculata', 39.968807, -105.54962),
 ('Tuberous Grasspink', 'Calopogon tuberosus', 45.70125048, -85.53653666)]

Lets use a for loop to include the rest of the rows into the table

In [31]:
#we delete all data from orchid so we can add data from csv 
#to the table
%sql DELETE FROM orchid;
%sql SELECT * FROM orchid;

#add 100 rows from from the csv to the tables
#io.capture_output supresses each print statement from sql code

for i in range(100):
    
    common_name = df.iloc[i].common_name
    scientific_name = df.iloc[i].scientific_name
    latitude = df.iloc[i].latitude
    longitude = df.iloc[i].longitude
    
    with io.capture_output(): #to stop outputs from printing
        %sql INSERT INTO orchid VALUES (:common_name, :scientific_name, :latitude, :longitude);

 * sqlite:///orchid.db
2 rows affected.
 * sqlite:///orchid.db
Done.

In [32]:
%%sql
SELECT * FROM orchid
LIMIT 5;

 * sqlite:///orchid.db
Done.

[('spotted coralroot', 'Corallorhiza maculata', 39.96880703, -105.5496204),
 ('Tuberous Grasspink', 'Calopogon tuberosus', 45.70125048, -85.53653666),
 ('crane-fly orchid', 'Tipularia discolor', 39.20595599, -77.29086307),
 ('crane-fly orchid', 'Tipularia discolor', 37.59629696, -77.47732401),
 ('crane-fly orchid', 'Tipularia discolor', 35.12957887, -85.35996842)]

## Modify table

### Insert and Delete a new Column

We use the <b>ALTER</> command to add a new column

In [33]:
%%sql
ALTER TABLE orchid
ADD COLUMN 'private_latitude' FLOAT;

ALTER TABLE orchid
ADD COLUMN 'private_longitude' FLOAT;

SELECT * FROM orchid LIMIT 5

 * sqlite:///orchid.db
Done.
Done.
Done.

[('spotted coralroot', 'Corallorhiza maculata', 39.96880703, -105.5496204, None, None),
 ('Tuberous Grasspink', 'Calopogon tuberosus', 45.70125048, -85.53653666, None, None),
 ('crane-fly orchid', 'Tipularia discolor', 39.20595599, -77.29086307, None, None),
 ('crane-fly orchid', 'Tipularia discolor', 37.59629696, -77.47732401, None, None),
 ('crane-fly orchid', 'Tipularia discolor', 35.12957887, -85.35996842, None, None)]

Lets drop the newly added columns

In [34]:
%%sql
ALTER TABLE orchid
DROP COLUMN 'private_latitude';
ALTER TABLE orchid
DROP COLUMN 'private_longitude';

SELECT * FROM orchid LIMIT 5

 * sqlite:///orchid.db
Done.
Done.
Done.

[('spotted coralroot', 'Corallorhiza maculata', 39.96880703, -105.5496204),
 ('Tuberous Grasspink', 'Calopogon tuberosus', 45.70125048, -85.53653666),
 ('crane-fly orchid', 'Tipularia discolor', 39.20595599, -77.29086307),
 ('crane-fly orchid', 'Tipularia discolor', 37.59629696, -77.47732401),
 ('crane-fly orchid', 'Tipularia discolor', 35.12957887, -85.35996842)]

### Truncate
To truncate a table the SQL command **TRUNCATE** doesn't work.  Instead we use the comman **DELETE**

In [35]:
%%sql
DELETE FROM orchid;
SELECT * FROM orchid LIMIT 5

 * sqlite:///orchid.db
100 rows affected.
Done.

[]

### Change the name of a column
To change the name of a column we use the command **RENAME**

In [36]:
%%sql
ALTER TABLE orchid RENAME 'scientific_name' TO 'scientificname';
SELECT * FROM orchid

 * sqlite:///orchid.db
Done.
Done.

[]

### Delete table
Now to delete the table, and to check if the table is actually deleted.

In [38]:
%sql DROP TABLE orchid
%sql SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:///orchid.db
(sqlite3.OperationalError) no such table: orchid
[SQL: DROP TABLE orchid]
(Background on this error at: https://sqlalche.me/e/20/e3q8)
 * sqlite:///orchid.db
Done.

[]

# Write the CSV to sql
Uncomment the following code to write new entries to the table **orchid_full**

In [43]:
%load_ext sql
%sql sqlite:///orchid.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [45]:
%%sql
CREATE TABLE IF NOT EXISTS orchid_all ('common name' char, 
                     'scientific_name' char, 
                     'latitude' float, 
                     'longitutde' float,
                     'date_observed_on'  date,
                     'place_guess' char,
                     'place_state_name' char,
                     'place_country_name' char );
SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:///orchid.db
Done.
Done.

[('orchid_all',)]

In [3]:
%%sql
DELETE FROM orchid_all;
SELECT* FROM orchid_all LIMIT 5

 * sqlite:///orchid.db
23734 rows affected.
Done.

[]

In [4]:
df= pd.read_csv('orchid_observation.csv', index_col='id')

%load_ext sql
%sql sqlite:///orchid.db

start_time_master = time.time()
start_time = time.time()

for i in range(len(df)):
    if i and i % 1000 == 0:
        et = time.time()-start_time_master
        m = math.floor(et/60)
        s = round(et-m*60, 2)
        
        print("number of inputs ", i, " time elapsed ", 
              m, " minutes ", s, " seconds")
        start_time = time.time()
        
    common_name = df.iloc[i].common_name
    scientific_name = df.iloc[i].scientific_name
    latitude = df.iloc[i].latitude
    longitude = df.iloc[i].longitude
    date_observed_on = df.iloc[i].date_observed_on
    place_guess = df.iloc[i].place_guess
    place_state_name = df.iloc[i].place_state_name
    place_country_name = df.iloc[i].place_country_name

    with io.capture_output(): #to stop outputs from printing
        %sql INSERT INTO orchid_all VALUES (:common_name, :scientific_name, :latitude, :longitude, :date_observed_on, :place_guess, :place_state_name, :place_country_name );
    #%sql INSERT INTO orchid_all VALUES (:common_name, :scientific_name, :latitude, :longitude, :date_observed_on, :place_guess, :place_state_name, :place_country_name);

elapsed_time = time.time()-start_time_master
minutes = math.floor(elapsed_time/60)
seconds = round(elapsed_time-minutes*60, 2)
print("\nit took: ", minutes, " minutes ", seconds, " seconds")

The sql extension is already loaded. To reload it, use:
  %reload_ext sql
number of inputs  1000  time elapsed  0  minutes  18.94  seconds
number of inputs  2000  time elapsed  0  minutes  36.07  seconds
number of inputs  3000  time elapsed  0  minutes  59.59  seconds
number of inputs  4000  time elapsed  1  minutes  11.34  seconds
number of inputs  5000  time elapsed  1  minutes  24.84  seconds
number of inputs  6000  time elapsed  1  minutes  37.39  seconds
number of inputs  7000  time elapsed  1  minutes  55.06  seconds
number of inputs  8000  time elapsed  2  minutes  20.85  seconds
number of inputs  9000  time elapsed  2  minutes  41.41  seconds
number of inputs  10000  time elapsed  3  minutes  1.46  seconds
number of inputs  11000  time elapsed  3  minutes  15.9  seconds
number of inputs  12000  time elapsed  3  minutes  33.17  seconds
number of inputs  13000  time elapsed  3  minutes  50.4  seconds
number of inputs  14000  time elapsed  4  minutes  12.85  seconds
number of inputs  15000  time elapsed  4  minutes  29.48  seconds
number of inputs  16000  time elapsed  4  minutes  45.93  seconds
number of inputs  17000  time elapsed  5  minutes  1.82  seconds
number of inputs  18000  time elapsed  5  minutes  19.77  seconds
number of inputs  19000  time elapsed  5  minutes  39.91  seconds
number of inputs  20000  time elapsed  6  minutes  1.0  seconds
number of inputs  21000  time elapsed  6  minutes  24.94  seconds
number of inputs  22000  time elapsed  6  minutes  38.42  seconds
number of inputs  23000  time elapsed  6  minutes  51.45  seconds
number of inputs  24000  time elapsed  7  minutes  5.24  seconds
number of inputs  25000  time elapsed  7  minutes  27.65  seconds
number of inputs  26000  time elapsed  7  minutes  51.41  seconds
number of inputs  27000  time elapsed  8  minutes  10.41  seconds
number of inputs  28000  time elapsed  8  minutes  34.4  seconds
number of inputs  29000  time elapsed  8  minutes  50.62  seconds
number of inputs  30000  time elapsed  9  minutes  14.85  seconds
number of inputs  31000  time elapsed  9  minutes  39.25  seconds
number of inputs  32000  time elapsed  10  minutes  5.97  seconds
number of inputs  33000  time elapsed  10  minutes  23.23  seconds
number of inputs  34000  time elapsed  10  minutes  45.47  seconds
number of inputs  35000  time elapsed  11  minutes  6.19  seconds
number of inputs  36000  time elapsed  11  minutes  26.61  seconds
number of inputs  37000  time elapsed  11  minutes  38.59  seconds
number of inputs  38000  time elapsed  11  minutes  52.59  seconds
number of inputs  39000  time elapsed  12  minutes  9.36  seconds
number of inputs  40000  time elapsed  12  minutes  21.72  seconds
number of inputs  41000  time elapsed  12  minutes  42.79  seconds
number of inputs  42000  time elapsed  13  minutes  9.61  seconds
number of inputs  43000  time elapsed  13  minutes  30.21  seconds
number of inputs  44000  time elapsed  13  minutes  46.54  seconds
number of inputs  45000  time elapsed  14  minutes  1.57  seconds
number of inputs  46000  time elapsed  14  minutes  13.03  seconds
number of inputs  47000  time elapsed  14  minutes  29.49  seconds
number of inputs  48000  time elapsed  14  minutes  49.71  seconds
number of inputs  49000  time elapsed  15  minutes  2.89  seconds
number of inputs  50000  time elapsed  15  minutes  16.25  seconds
number of inputs  51000  time elapsed  15  minutes  34.97  seconds
number of inputs  52000  time elapsed  15  minutes  51.65  seconds
number of inputs  53000  time elapsed  16  minutes  11.93  seconds
number of inputs  54000  time elapsed  16  minutes  24.86  seconds
number of inputs  55000  time elapsed  16  minutes  44.35  seconds
number of inputs  56000  time elapsed  17  minutes  5.75  seconds
number of inputs  57000  time elapsed  17  minutes  21.69  seconds
number of inputs  58000  time elapsed  17  minutes  39.49  seconds
number of inputs  59000  time elapsed  17  minutes  59.92  seconds
number of inputs  60000  time elapsed  18  minutes  22.3  seconds
number of inputs  61000  time elapsed  18  minutes  45.6  seconds
number of inputs  62000  time elapsed  19  minutes  10.49  seconds
number of inputs  63000  time elapsed  19  minutes  35.21  seconds
number of inputs  64000  time elapsed  19  minutes  59.6  seconds
number of inputs  65000  time elapsed  20  minutes  20.74  seconds
number of inputs  66000  time elapsed  20  minutes  47.43  seconds
number of inputs  67000  time elapsed  21  minutes  10.81  seconds
number of inputs  68000  time elapsed  21  minutes  26.35  seconds
number of inputs  69000  time elapsed  21  minutes  48.05  seconds
number of inputs  70000  time elapsed  22  minutes  5.02  seconds
number of inputs  71000  time elapsed  22  minutes  27.32  seconds
number of inputs  72000  time elapsed  22  minutes  44.61  seconds
number of inputs  73000  time elapsed  23  minutes  1.02  seconds
number of inputs  74000  time elapsed  23  minutes  16.6  seconds
number of inputs  75000  time elapsed  23  minutes  35.61  seconds
number of inputs  76000  time elapsed  23  minutes  57.6  seconds
number of inputs  77000  time elapsed  24  minutes  15.66  seconds
number of inputs  78000  time elapsed  24  minutes  36.79  seconds
number of inputs  79000  time elapsed  24  minutes  58.7  seconds
number of inputs  80000  time elapsed  25  minutes  14.98  seconds
number of inputs  81000  time elapsed  25  minutes  34.24  seconds
number of inputs  82000  time elapsed  25  minutes  54.97  seconds
number of inputs  83000  time elapsed  26  minutes  17.23  seconds
number of inputs  84000  time elapsed  26  minutes  36.94  seconds
number of inputs  85000  time elapsed  27  minutes  0.18  seconds
number of inputs  86000  time elapsed  27  minutes  18.61  seconds
number of inputs  87000  time elapsed  27  minutes  37.0  seconds
number of inputs  88000  time elapsed  27  minutes  53.56  seconds
number of inputs  89000  time elapsed  28  minutes  10.88  seconds
number of inputs  90000  time elapsed  28  minutes  27.79  seconds
number of inputs  91000  time elapsed  28  minutes  46.4  seconds
number of inputs  92000  time elapsed  29  minutes  3.02  seconds
number of inputs  93000  time elapsed  29  minutes  18.02  seconds
number of inputs  94000  time elapsed  29  minutes  30.43  seconds
number of inputs  95000  time elapsed  29  minutes  45.27  seconds
number of inputs  96000  time elapsed  29  minutes  57.75  seconds
number of inputs  97000  time elapsed  30  minutes  13.38  seconds
number of inputs  98000  time elapsed  30  minutes  29.51  seconds
number of inputs  99000  time elapsed  30  minutes  44.39  seconds
number of inputs  100000  time elapsed  30  minutes  59.19  seconds
number of inputs  101000  time elapsed  31  minutes  16.94  seconds
number of inputs  102000  time elapsed  31  minutes  37.09  seconds
number of inputs  103000  time elapsed  31  minutes  57.3  seconds
number of inputs  104000  time elapsed  32  minutes  15.72  seconds
number of inputs  105000  time elapsed  32  minutes  36.3  seconds
number of inputs  106000  time elapsed  32  minutes  51.87  seconds
number of inputs  107000  time elapsed  33  minutes  8.35  seconds
number of inputs  108000  time elapsed  33  minutes  26.53  seconds
number of inputs  109000  time elapsed  33  minutes  42.54  seconds
number of inputs  110000  time elapsed  33  minutes  57.7  seconds
number of inputs  111000  time elapsed  34  minutes  14.48  seconds
number of inputs  112000  time elapsed  34  minutes  29.88  seconds
number of inputs  113000  time elapsed  34  minutes  42.81  seconds
number of inputs  114000  time elapsed  34  minutes  55.71  seconds
number of inputs  115000  time elapsed  35  minutes  9.05  seconds
number of inputs  116000  time elapsed  35  minutes  22.96  seconds
number of inputs  117000  time elapsed  35  minutes  37.81  seconds
number of inputs  118000  time elapsed  35  minutes  53.08  seconds
number of inputs  119000  time elapsed  36  minutes  6.27  seconds
number of inputs  120000  time elapsed  36  minutes  20.91  seconds
number of inputs  121000  time elapsed  36  minutes  38.06  seconds
number of inputs  122000  time elapsed  36  minutes  57.52  seconds
number of inputs  123000  time elapsed  37  minutes  15.31  seconds
number of inputs  124000  time elapsed  37  minutes  33.29  seconds
number of inputs  125000  time elapsed  37  minutes  52.34  seconds
number of inputs  126000  time elapsed  38  minutes  12.88  seconds
number of inputs  127000  time elapsed  38  minutes  30.25  seconds
number of inputs  128000  time elapsed  38  minutes  50.6  seconds
number of inputs  129000  time elapsed  39  minutes  11.15  seconds
number of inputs  130000  time elapsed  39  minutes  29.14  seconds
number of inputs  131000  time elapsed  39  minutes  44.27  seconds
number of inputs  132000  time elapsed  39  minutes  59.35  seconds

it took:  40  minutes  4.9  seconds

In [5]:
%%sql
SELECT * FROM orchid_all
LIMIT 5;

 * sqlite:///orchid.db
Done.

[('spotted coralroot', 'Corallorhiza maculata', 39.96880703, -105.5496204, '2017-06-28', '136 Bergren Road Nederland, CO 80466', 'Colorado', 'United States'),
 ('Tuberous Grasspink', 'Calopogon tuberosus', 45.70125048, -85.53653666, '2017-01-01', 'Beaver Island, Peaine, MI, US', 'Michigan', 'United States'),
 ('crane-fly orchid', 'Tipularia discolor', 39.20595599, -77.29086307, '2017-01-01', 'Black Hill Regional Park, Boyds, MD', 'Maryland', 'United States'),
 ('crane-fly orchid', 'Tipularia discolor', 37.59629696, -77.47732401, '2017-01-01', 'Northside, Richmond, VA, USA', 'Virginia', 'United States'),
 ('crane-fly orchid', 'Tipularia discolor', 35.12957887, -85.35996842, '2017-01-01', '37377, Signal Mountain, TN, US', 'Tennessee', 'United States')]